frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/lcdca.h
#define LCDCA_CFG_XBIAS_Pos         0            /**< \brief (LCDCA_CFG) External Bias Generation */
#define LCDCA_CFG_XBIAS             (_U(0x1) << LCDCA_CFG_XBIAS_Pos)
#define LCDCA_CFG_WMOD_Pos          1            /**< \brief (LCDCA_CFG) Waveform Mode */
#define LCDCA_CFG_WMOD              (_U(0x1) << LCDCA_CFG_WMOD_Pos)
#define LCDCA_CFG_BLANK_Pos         2            /**< \brief (LCDCA_CFG) Blank LCD */
#define LCDCA_CFG_BLANK             (_U(0x1) << LCDCA_CFG_BLANK_Pos)
#define LCDCA_CFG_LOCK_Pos          3            /**< \brief (LCDCA_CFG) Lock */
#define LCDCA_CFG_LOCK              (_U(0x1) << LCDCA_CFG_LOCK_Pos)
#define LCDCA_CFG_DUTY_Pos          8            /**< \brief (LCDCA_CFG) Duty Select */
#define LCDCA_CFG_DUTY_Msk          (_U(0x3) << LCDCA_CFG_DUTY_Pos)
#define LCDCA_CFG_DUTY(value)       (LCDCA_CFG_DUTY_Msk & ((value) << LCDCA_CFG_DUTY_Pos))
#define LCDCA_CFG_FCST_Pos          16           /**< \brief (LCDCA_CFG) Fine Contrast */
#define LCDCA_CFG_FCST_Msk          (_U(0x3F) << LCDCA_CFG_FCST_Pos)
#define LCDCA_CFG_FCST(value)       (LCDCA_CFG_FCST_Msk & ((value) << LCDCA_CFG_FCST_Pos))
#define LCDCA_CFG_NSU_Pos           24           /**< \brief (LCDCA_CFG) Number of Segment Terminals in Use */
#define LCDCA_CFG_NSU_Msk           (_U(0x3F) << LCDCA_CFG_NSU_Pos)
#define LCDCA_CFG_NSU(value)        (LCDCA_CFG_NSU_Msk & ((value) << LCDCA_CFG_NSU_Pos))
#define LCDCA_CFG_MASK              _U(0x3F3F030F) /**< \brief (LCDCA_CFG) MASK Register */

/* -------- LCDCA_TIM : (LCDCA Offset: 0x08) (R/W 32) Timing Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PRESC:1;          /*!< bit:      0  LCD Prescaler Select               */
    uint32_t CLKDIV:3;         /*!< bit:  1.. 3  LCD Clock Division                 */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t FC0:5;            /*!< bit:  8..12  Frame Counter 0                    */
    uint32_t FC0PB:1;          /*!< bit:     13  Frame Counter 0 Prescaler Bypass   */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t FC1:5;            /*!< bit: 16..20  Frame Counter 1                    */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t FC2:5;            /*!< bit: 24..28  Frame Counter 2                    */
    uint32_t :3;               /*!< bit: 29..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_TIM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_TIM_OFFSET            0x08         /**< \brief (LCDCA_TIM offset) Timing Register */
#define LCDCA_TIM_RESETVALUE        _U(0x00000000); /**< \brief (LCDCA_TIM reset_value) Timing Register */

#define LCDCA_TIM_PRESC_Pos         0            /**< \brief (LCDCA_TIM) LCD Prescaler Select */
#define LCDCA_TIM_PRESC             (_U(0x1) << LCDCA_TIM_PRESC_Pos)
#define LCDCA_TIM_CLKDIV_Pos        1            /**< \brief (LCDCA_TIM) LCD Clock Division */
#define LCDCA_TIM_CLKDIV_Msk        (_U(0x7) << LCDCA_TIM_CLKDIV_Pos)
#define LCDCA_TIM_CLKDIV(value)     (LCDCA_TIM_CLKDIV_Msk & ((value) << LCDCA_TIM_CLKDIV_Pos))
#define LCDCA_TIM_FC0_Pos           8            /**< \brief (LCDCA_TIM) Frame Counter 0 */
#define LCDCA_TIM_FC0_Msk           (_U(0x1F) << LCDCA_TIM_FC0_Pos)
#define LCDCA_TIM_FC0(value)        (LCDCA_TIM_FC0_Msk & ((value) << LCDCA_TIM_FC0_Pos))
#define LCDCA_TIM_FC0PB_Pos         13           /**< \brief (LCDCA_TIM) Frame Counter 0 Prescaler Bypass */
#define LCDCA_TIM_FC0PB             (_U(0x1) << LCDCA_TIM_FC0PB_Pos)
#define LCDCA_TIM_FC1_Pos           16           /**< \brief (LCDCA_TIM) Frame Counter 1 */
#define LCDCA_TIM_FC1_Msk           (_U(0x1F) << LCDCA_TIM_FC1_Pos)
#define LCDCA_TIM_FC1(value)        (LCDCA_TIM_FC1_Msk & ((value) << LCDCA_TIM_FC1_Pos))
#define LCDCA_TIM_FC2_Pos           24           /**< \brief (LCDCA_TIM) Frame Counter 2 */
#define LCDCA_TIM_FC2_Msk           (_U(0x1F) << LCDCA_TIM_FC2_Pos)
#define LCDCA_TIM_FC2(value)        (LCDCA_TIM_FC2_Msk & ((value) << LCDCA_TIM_FC2_Pos))
#define LCDCA_TIM_MASK              _U(0x1F1F3F0F) /**< \brief (LCDCA_TIM) MASK Register */

/* -------- LCDCA_SR : (LCDCA Offset: 0x0C) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FC0R:1;           /*!< bit:      0  Frame Counter 0 Rollover           */
    uint32_t FC0S:1;           /*!< bit:      1  Frame Counter 0 Status             */
    uint32_t FC1S:1;           /*!< bit:      2  Frame Counter 1 Status             */
    uint32_t FC2S:1;           /*!< bit:      3  Frame Counter 2 Status             */
    uint32_t EN:1;             /*!< bit:      4  LCDCA Status                       */
    uint32_t WEN:1;            /*!< bit:      5  Wake up Status                     */
    uint32_t BLKS:1;           /*!< bit:      6  Blink Status                       */
    uint32_t CSRS:1;           /*!< bit:      7  Circular Shift Register Status     */
    uint32_t CPS:1;            /*!< bit:      8  Charge Pump Status                 */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_SR_OFFSET             0x0C         /**< \brief (LCDCA_SR offset) Status Register */
#define LCDCA_SR_RESETVALUE         _U(0x00000000); /**< \brief (LCDCA_SR reset_value) Status Register */

#define LCDCA_SR_FC0R_Pos           0            /**< \brief (LCDCA_SR) Frame Counter 0 Rollover */
#define LCDCA_SR_FC0R               (_U(0x1) << LCDCA_SR_FC0R_Pos)
#define LCDCA_SR_FC0S_Pos           1            /**< \brief (LCDCA_SR) Frame Counter 0 Status */
#define LCDCA_SR_FC0S               (_U(0x1) << LCDCA_SR_FC0S_Pos)
#define LCDCA_SR_FC1S_Pos           2            /**< \brief (LCDCA_SR) Frame Counter 1 Status */
#define LCDCA_SR_FC1S               (_U(0x1) << LCDCA_SR_FC1S_Pos)
#define LCDCA_SR_FC2S_Pos           3            /**< \brief (LCDCA_SR) Frame Counter 2 Status */
#define LCDCA_SR_FC2S               (_U(0x1) << LCDCA_SR_FC2S_Pos)
#define LCDCA_SR_EN_Pos             4            /**< \brief (LCDCA_SR) LCDCA Status */
#define LCDCA_SR_EN                 (_U(0x1) << LCDCA_SR_EN_Pos)
#define LCDCA_SR_WEN_Pos            5            /**< \brief (LCDCA_SR) Wake up Status */
#define LCDCA_SR_WEN                (_U(0x1) << LCDCA_SR_WEN_Pos)
#define LCDCA_SR_BLKS_Pos           6            /**< \brief (LCDCA_SR) Blink Status */
#define LCDCA_SR_BLKS               (_U(0x1) << LCDCA_SR_BLKS_Pos)
#define LCDCA_SR_CSRS_Pos           7            /**< \brief (LCDCA_SR) Circular Shift Register Status */
#define LCDCA_SR_CSRS               (_U(0x1) << LCDCA_SR_CSRS_Pos)
#define LCDCA_SR_CPS_Pos            8            /**< \brief (LCDCA_SR) Charge Pump Status */
#define LCDCA_SR_CPS                (_U(0x1) << LCDCA_SR_CPS_Pos)
#define LCDCA_SR_MASK               _U(0x000001FF) /**< \brief (LCDCA_SR) MASK Register */

/* -------- LCDCA_SCR : (LCDCA Offset: 0x10) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FC0R:1;           /*!< bit:      0  Frame Counter 0 Rollover           */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_SCR_OFFSET            0x10         /**< \brief (LCDCA_SCR offset) Status Clear Register */
#define LCDCA_SCR_RESETVALUE        _U(0x00000000); /**< \brief (LCDCA_SCR reset_value) Status Clear Register */

#define LCDCA_SCR_FC0R_Pos          0            /**< \brief (LCDCA_SCR) Frame Counter 0 Rollover */
#define LCDCA_SCR_FC0R              (_U(0x1) << LCDCA_SCR_FC0R_Pos)
#define LCDCA_SCR_MASK              _U(0x00000001) /**< \brief (LCDCA_SCR) MASK Register */

/* -------- LCDCA_DRL0 : (LCDCA Offset: 0x14) (R/W 32) Data Register Low 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Segments Value                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRL0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRL0_OFFSET           0x14         /**< \brief (LCDCA_DRL0 offset) Data Register Low 0 */
#define LCDCA_DRL0_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRL0 reset_value) Data Register Low 0 */

#define LCDCA_DRL0_DATA_Pos         0            /**< \brief (LCDCA_DRL0) Segments Value */
#define LCDCA_DRL0_DATA_Msk         (_U(0xFFFFFFFF) << LCDCA_DRL0_DATA_Pos)
#define LCDCA_DRL0_DATA(value)      (LCDCA_DRL0_DATA_Msk & ((value) << LCDCA_DRL0_DATA_Pos))
#define LCDCA_DRL0_MASK             _U(0xFFFFFFFF) /**< \brief (LCDCA_DRL0) MASK Register */

/* -------- LCDCA_DRH0 : (LCDCA Offset: 0x18) (R/W 32) Data Register High 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRH0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRH0_OFFSET           0x18         /**< \brief (LCDCA_DRH0 offset) Data Register High 0 */
#define LCDCA_DRH0_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRH0 reset_value) Data Register High 0 */

