frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/lcdca.h
/* -------- LCDCA_DRH3 : (LCDCA Offset: 0x30) (R/W 32) Data Register High 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRH3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRH3_OFFSET           0x30         /**< \brief (LCDCA_DRH3 offset) Data Register High 3 */
#define LCDCA_DRH3_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRH3 reset_value) Data Register High 3 */

#define LCDCA_DRH3_DATA_Pos         0            /**< \brief (LCDCA_DRH3) Segments Value */
#define LCDCA_DRH3_DATA_Msk         (_U(0xFF) << LCDCA_DRH3_DATA_Pos)
#define LCDCA_DRH3_DATA(value)      (LCDCA_DRH3_DATA_Msk & ((value) << LCDCA_DRH3_DATA_Pos))
#define LCDCA_DRH3_MASK             _U(0x000000FF) /**< \brief (LCDCA_DRH3) MASK Register */

/* -------- LCDCA_IADR : (LCDCA Offset: 0x34) ( /W 32) Indirect Access Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t DMASK:8;          /*!< bit:  8..15  Data Mask                          */
    uint32_t OFF:5;            /*!< bit: 16..20  Byte Offset                        */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_IADR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_IADR_OFFSET           0x34         /**< \brief (LCDCA_IADR offset) Indirect Access Data Register */
#define LCDCA_IADR_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_IADR reset_value) Indirect Access Data Register */

#define LCDCA_IADR_DATA_Pos         0            /**< \brief (LCDCA_IADR) Segments Value */
#define LCDCA_IADR_DATA_Msk         (_U(0xFF) << LCDCA_IADR_DATA_Pos)
#define LCDCA_IADR_DATA(value)      (LCDCA_IADR_DATA_Msk & ((value) << LCDCA_IADR_DATA_Pos))
#define LCDCA_IADR_DMASK_Pos        8            /**< \brief (LCDCA_IADR) Data Mask */
#define LCDCA_IADR_DMASK_Msk        (_U(0xFF) << LCDCA_IADR_DMASK_Pos)
#define LCDCA_IADR_DMASK(value)     (LCDCA_IADR_DMASK_Msk & ((value) << LCDCA_IADR_DMASK_Pos))
#define LCDCA_IADR_OFF_Pos          16           /**< \brief (LCDCA_IADR) Byte Offset */
#define LCDCA_IADR_OFF_Msk          (_U(0x1F) << LCDCA_IADR_OFF_Pos)
#define LCDCA_IADR_OFF(value)       (LCDCA_IADR_OFF_Msk & ((value) << LCDCA_IADR_OFF_Pos))
#define LCDCA_IADR_MASK             _U(0x001FFFFF) /**< \brief (LCDCA_IADR) MASK Register */

/* -------- LCDCA_BCFG : (LCDCA Offset: 0x38) (R/W 32) Blink Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MODE:1;           /*!< bit:      0  Blinking Mode                      */
    uint32_t FCS:2;            /*!< bit:  1.. 2  Frame Counter Selection            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t BSS0:4;           /*!< bit:  8..11  Blink Segment Selection 0          */
    uint32_t BSS1:4;           /*!< bit: 12..15  Blink Segment Selection 1          */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_BCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_BCFG_OFFSET           0x38         /**< \brief (LCDCA_BCFG offset) Blink Configuration Register */
#define LCDCA_BCFG_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_BCFG reset_value) Blink Configuration Register */

#define LCDCA_BCFG_MODE_Pos         0            /**< \brief (LCDCA_BCFG) Blinking Mode */
#define LCDCA_BCFG_MODE             (_U(0x1) << LCDCA_BCFG_MODE_Pos)
#define LCDCA_BCFG_FCS_Pos          1            /**< \brief (LCDCA_BCFG) Frame Counter Selection */
#define LCDCA_BCFG_FCS_Msk          (_U(0x3) << LCDCA_BCFG_FCS_Pos)
#define LCDCA_BCFG_FCS(value)       (LCDCA_BCFG_FCS_Msk & ((value) << LCDCA_BCFG_FCS_Pos))
#define LCDCA_BCFG_BSS0_Pos         8            /**< \brief (LCDCA_BCFG) Blink Segment Selection 0 */
#define LCDCA_BCFG_BSS0_Msk         (_U(0xF) << LCDCA_BCFG_BSS0_Pos)
#define LCDCA_BCFG_BSS0(value)      (LCDCA_BCFG_BSS0_Msk & ((value) << LCDCA_BCFG_BSS0_Pos))
#define LCDCA_BCFG_BSS1_Pos         12           /**< \brief (LCDCA_BCFG) Blink Segment Selection 1 */
#define LCDCA_BCFG_BSS1_Msk         (_U(0xF) << LCDCA_BCFG_BSS1_Pos)
#define LCDCA_BCFG_BSS1(value)      (LCDCA_BCFG_BSS1_Msk & ((value) << LCDCA_BCFG_BSS1_Pos))
#define LCDCA_BCFG_MASK             _U(0x0000FF07) /**< \brief (LCDCA_BCFG) MASK Register */

/* -------- LCDCA_CSRCFG : (LCDCA Offset: 0x3C) (R/W 32) Circular Shift Register Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DIR:1;            /*!< bit:      0  Direction                          */
    uint32_t FCS:2;            /*!< bit:  1.. 2  Frame Counter Selection            */
    uint32_t SIZE:3;           /*!< bit:  3.. 5  Size                               */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t DATA:8;           /*!< bit:  8..15  Circular Shift Register Value      */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_CSRCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_CSRCFG_OFFSET         0x3C         /**< \brief (LCDCA_CSRCFG offset) Circular Shift Register Configuration */
#define LCDCA_CSRCFG_RESETVALUE     _U(0x00000000); /**< \brief (LCDCA_CSRCFG reset_value) Circular Shift Register Configuration */

#define LCDCA_CSRCFG_DIR_Pos        0            /**< \brief (LCDCA_CSRCFG) Direction */
#define LCDCA_CSRCFG_DIR            (_U(0x1) << LCDCA_CSRCFG_DIR_Pos)
#define LCDCA_CSRCFG_FCS_Pos        1            /**< \brief (LCDCA_CSRCFG) Frame Counter Selection */
#define LCDCA_CSRCFG_FCS_Msk        (_U(0x3) << LCDCA_CSRCFG_FCS_Pos)
#define LCDCA_CSRCFG_FCS(value)     (LCDCA_CSRCFG_FCS_Msk & ((value) << LCDCA_CSRCFG_FCS_Pos))
#define LCDCA_CSRCFG_SIZE_Pos       3            /**< \brief (LCDCA_CSRCFG) Size */
#define LCDCA_CSRCFG_SIZE_Msk       (_U(0x7) << LCDCA_CSRCFG_SIZE_Pos)
#define LCDCA_CSRCFG_SIZE(value)    (LCDCA_CSRCFG_SIZE_Msk & ((value) << LCDCA_CSRCFG_SIZE_Pos))
#define LCDCA_CSRCFG_DATA_Pos       8            /**< \brief (LCDCA_CSRCFG) Circular Shift Register Value */
#define LCDCA_CSRCFG_DATA_Msk       (_U(0xFF) << LCDCA_CSRCFG_DATA_Pos)
#define LCDCA_CSRCFG_DATA(value)    (LCDCA_CSRCFG_DATA_Msk & ((value) << LCDCA_CSRCFG_DATA_Pos))
#define LCDCA_CSRCFG_MASK           _U(0x0000FF3F) /**< \brief (LCDCA_CSRCFG) MASK Register */

